In [1]:
import pandas as pd

In [2]:
import numpy as np
state = ['ohio','ohio','ohio','nevada','nevada','nevada']
data = {'state':state,
       'year': [2000,2001,2002,2001,2002,2003],
       'pop': [1.5,1.7,3.6,2.4,2.9,3.2]}
state_pop = pd.DataFrame(data,columns=['year','state','pop','debt'],
                       index = ['one','two','three','four','five','six'])
print(state_pop)
#state_pop.fillna(123)
l = len(state_pop)
f = np.arange(l)
state_pop['debt'] = f
state_pop

       year   state  pop debt
one    2000    ohio  1.5  NaN
two    2001    ohio  1.7  NaN
three  2002    ohio  3.6  NaN
four   2001  nevada  2.4  NaN
five   2002  nevada  2.9  NaN
six    2003  nevada  3.2  NaN

       year   state  pop  debt
one    2000    ohio  1.5     0
two    2001    ohio  1.7     1
three  2002    ohio  3.6     2
four   2001  nevada  2.4     3
five   2002  nevada  2.9     4
six    2003  nevada  3.2     5

In [7]:
val = pd.Series([1.2,2.3,3.4,4.5,5.6,6.7], index = ['one','two','three','four','eight','seven'])
lst = np.array(val.values)
state_pop['debt'] = lst
state_pop

       year   state  pop  debt
one    2000    ohio  1.5   1.2
two    2001    ohio  1.7   2.3
three  2002    ohio  3.6   3.4
four   2001  nevada  2.4   4.5
five   2002  nevada  2.9   5.6
six    2003  nevada  3.2   6.7

In [17]:
obj = pd.Series(['blue','purple','yellow'], index = [0,3,6])
print(obj)
obj = obj.reindex(range(9), method = 'ffill') #FFILL purani wali value ko agy null values main fill kr dega
obj

0      blue
3    purple
6    yellow
dtype: object

0      blue
1      blue
2      blue
3    purple
4    purple
5    purple
6    yellow
7    yellow
8    yellow
dtype: object

In [19]:
states = pd.DataFrame(np.arange(9).reshape((3,3)), index = ['a','c','d'], columns = ['ohio','texas','california'])
print(states)
states = states.reindex(['a','b','c','d'], method = 'ffill')
print(states)

   ohio  texas  california
a     0      1           2
c     3      4           5
d     6      7           8
   ohio  texas  california
a     0      1           2
b     0      1           2
c     3      4           5
d     6      7           8

In [78]:
states = pd.DataFrame(np.arange(9).reshape((3,3)), index = ['a','c','d'], columns = ['ohio','texas','california'])
print(states)
name = ['ohio','texas','utah','california']
states = states.reindex(columns=name)
#states = states.ffill(axis=1)
states

   ohio  texas  california
a     0      1           2
c     3      4           5
d     6      7           8

   ohio  texas  utah  california
a     0      1   NaN           2
c     3      4   NaN           5
d     6      7   NaN           8

In [79]:
states

   ohio  texas  utah  california
a     0      1   NaN           2
c     3      4   NaN           5
d     6      7   NaN           8

In [80]:
#dropna (do yourself)

LOC = takes labels of dataframe in order to access
ILOC = takes indexes in order to access

In [81]:
data_df = pd.DataFrame(np.arange(16).reshape((4,4)), index = ['ohio','colorado','utah','newyork'],
                       columns=['one','two','three','four'])
print(data_df.iloc[:])
print(data_df.iloc[:,:3])
print(data_df.iloc[:2])

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
newyork    12   13     14    15
          one  two  three
ohio        0    1      2
colorado    4    5      6
utah        8    9     10
newyork    12   13     14
          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7

In [82]:
print(data_df.loc[['colorado'],('one','two')])
#print(data_df.loc['colorado',['two','three']])

          one  two
colorado    4    5

In [96]:
import numpy as np
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)),columns = list('bcd'),
                  index = ['ohio','texas','colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4,3)),columns = list('bde'),
                  index = ['utah','ohio','texas','oregon'])
print(df1)
print(df2)
df3 = df1+df2
df3

            b    c    d
ohio      0.0  1.0  2.0
texas     3.0  4.0  5.0
colorado  6.0  7.0  8.0
          b     d     e
utah    0.0   1.0   2.0
ohio    3.0   4.0   5.0
texas   6.0   7.0   8.0
oregon  9.0  10.0  11.0

            b   c     d   e
colorado  NaN NaN   NaN NaN
ohio      3.0 NaN   6.0 NaN
oregon    NaN NaN   NaN NaN
texas     9.0 NaN  12.0 NaN
utah      NaN NaN   NaN NaN